keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEray_reg.h
/** \\brief  3F4, Endian Register */
#define ERAY1_ENDN /*lint --e(923)*/ (*(volatile Ifx_ERAY_ENDN*)0xF00173F4u)

/** \\brief  130, Even Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register ESID_1S[0]/ESID_1S0 corresponds to user manual
 * ESID_1S1, ... */
#define ERAY1_ESID_1S0 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ESID*)0xF0017130u)

/** Alias (User Manual Name) for ERAY1_ESID_1S0.
* To use register names with standard convension, please use ERAY1_ESID_1S0.
*/
#define	ERAY1_ESID01	(ERAY1_ESID_1S0)

/** \\brief  134, Even Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register ESID_1S[0]/ESID_1S0 corresponds to user manual
 * ESID_1S1, ... */
#define ERAY1_ESID_1S1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ESID*)0xF0017134u)

/** Alias (User Manual Name) for ERAY1_ESID_1S1.
* To use register names with standard convension, please use ERAY1_ESID_1S1.
*/
#define	ERAY1_ESID02	(ERAY1_ESID_1S1)

/** \\brief  158, Even Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register ESID_1S[0]/ESID_1S0 corresponds to user manual
 * ESID_1S1, ... */
#define ERAY1_ESID_1S10 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ESID*)0xF0017158u)

/** Alias (User Manual Name) for ERAY1_ESID_1S10.
* To use register names with standard convension, please use ERAY1_ESID_1S10.
*/
#define	ERAY1_ESID11	(ERAY1_ESID_1S10)

/** \\brief  15C, Even Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register ESID_1S[0]/ESID_1S0 corresponds to user manual
 * ESID_1S1, ... */
#define ERAY1_ESID_1S11 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ESID*)0xF001715Cu)

/** Alias (User Manual Name) for ERAY1_ESID_1S11.
* To use register names with standard convension, please use ERAY1_ESID_1S11.
*/
#define	ERAY1_ESID12	(ERAY1_ESID_1S11)

/** \\brief  160, Even Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register ESID_1S[0]/ESID_1S0 corresponds to user manual
 * ESID_1S1, ... */
#define ERAY1_ESID_1S12 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ESID*)0xF0017160u)

/** Alias (User Manual Name) for ERAY1_ESID_1S12.
* To use register names with standard convension, please use ERAY1_ESID_1S12.
*/
#define	ERAY1_ESID13	(ERAY1_ESID_1S12)

/** \\brief  164, Even Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register ESID_1S[0]/ESID_1S0 corresponds to user manual
 * ESID_1S1, ... */
#define ERAY1_ESID_1S13 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ESID*)0xF0017164u)

/** Alias (User Manual Name) for ERAY1_ESID_1S13.
* To use register names with standard convension, please use ERAY1_ESID_1S13.
*/
#define	ERAY1_ESID14	(ERAY1_ESID_1S13)

/** \\brief  168, Even Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register ESID_1S[0]/ESID_1S0 corresponds to user manual
 * ESID_1S1, ... */
#define ERAY1_ESID_1S14 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ESID*)0xF0017168u)

/** Alias (User Manual Name) for ERAY1_ESID_1S14.
* To use register names with standard convension, please use ERAY1_ESID_1S14.
*/
#define	ERAY1_ESID15	(ERAY1_ESID_1S14)

/** \\brief  138, Even Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register ESID_1S[0]/ESID_1S0 corresponds to user manual
 * ESID_1S1, ... */
#define ERAY1_ESID_1S2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ESID*)0xF0017138u)

/** Alias (User Manual Name) for ERAY1_ESID_1S2.
* To use register names with standard convension, please use ERAY1_ESID_1S2.
*/
#define	ERAY1_ESID03	(ERAY1_ESID_1S2)

/** \\brief  13C, Even Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register ESID_1S[0]/ESID_1S0 corresponds to user manual
 * ESID_1S1, ... */
#define ERAY1_ESID_1S3 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ESID*)0xF001713Cu)

/** Alias (User Manual Name) for ERAY1_ESID_1S3.
* To use register names with standard convension, please use ERAY1_ESID_1S3.
*/
#define	ERAY1_ESID04	(ERAY1_ESID_1S3)

/** \\brief  140, Even Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register ESID_1S[0]/ESID_1S0 corresponds to user manual
 * ESID_1S1, ... */
#define ERAY1_ESID_1S4 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ESID*)0xF0017140u)

/** Alias (User Manual Name) for ERAY1_ESID_1S4.
* To use register names with standard convension, please use ERAY1_ESID_1S4.
*/
#define	ERAY1_ESID05	(ERAY1_ESID_1S4)

/** \\brief  144, Even Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register ESID_1S[0]/ESID_1S0 corresponds to user manual
 * ESID_1S1, ... */
#define ERAY1_ESID_1S5 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ESID*)0xF0017144u)

/** Alias (User Manual Name) for ERAY1_ESID_1S5.
* To use register names with standard convension, please use ERAY1_ESID_1S5.
*/
#define	ERAY1_ESID06	(ERAY1_ESID_1S5)

/** \\brief  148, Even Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register ESID_1S[0]/ESID_1S0 corresponds to user manual
 * ESID_1S1, ... */
#define ERAY1_ESID_1S6 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ESID*)0xF0017148u)

/** Alias (User Manual Name) for ERAY1_ESID_1S6.
* To use register names with standard convension, please use ERAY1_ESID_1S6.
*/
#define	ERAY1_ESID07	(ERAY1_ESID_1S6)

/** \\brief  14C, Even Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register ESID_1S[0]/ESID_1S0 corresponds to user manual
 * ESID_1S1, ... */
#define ERAY1_ESID_1S7 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ESID*)0xF001714Cu)

/** Alias (User Manual Name) for ERAY1_ESID_1S7.
* To use register names with standard convension, please use ERAY1_ESID_1S7.
*/
#define	ERAY1_ESID08	(ERAY1_ESID_1S7)

/** \\brief  150, Even Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register ESID_1S[0]/ESID_1S0 corresponds to user manual
 * ESID_1S1, ... */
#define ERAY1_ESID_1S8 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ESID*)0xF0017150u)

/** Alias (User Manual Name) for ERAY1_ESID_1S8.
* To use register names with standard convension, please use ERAY1_ESID_1S8.
*/
#define	ERAY1_ESID09	(ERAY1_ESID_1S8)

/** \\brief  154, Even Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register ESID_1S[0]/ESID_1S0 corresponds to user manual
 * ESID_1S1, ... */
#define ERAY1_ESID_1S9 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ESID*)0xF0017154u)

/** Alias (User Manual Name) for ERAY1_ESID_1S9.
* To use register names with standard convension, please use ERAY1_ESID_1S9.
*/
#define	ERAY1_ESID10	(ERAY1_ESID_1S9)

/** \\brief  30C, FIFO Critical Level */
#define ERAY1_FCL /*lint --e(923)*/ (*(volatile Ifx_ERAY_FCL*)0xF001730Cu)

