keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEray_reg.h
/** \\brief  604, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017604u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S1.
* To use register names with standard convension, please use ERAY1_RDDS_1S1.
*/
#define	ERAY1_RDDS02	(ERAY1_RDDS_1S1)

/** \\brief  628, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S10 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017628u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S10.
* To use register names with standard convension, please use ERAY1_RDDS_1S10.
*/
#define	ERAY1_RDDS11	(ERAY1_RDDS_1S10)

/** \\brief  62C, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S11 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001762Cu)

/** Alias (User Manual Name) for ERAY1_RDDS_1S11.
* To use register names with standard convension, please use ERAY1_RDDS_1S11.
*/
#define	ERAY1_RDDS12	(ERAY1_RDDS_1S11)

/** \\brief  630, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S12 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017630u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S12.
* To use register names with standard convension, please use ERAY1_RDDS_1S12.
*/
#define	ERAY1_RDDS13	(ERAY1_RDDS_1S12)

/** \\brief  634, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S13 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017634u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S13.
* To use register names with standard convension, please use ERAY1_RDDS_1S13.
*/
#define	ERAY1_RDDS14	(ERAY1_RDDS_1S13)

/** \\brief  638, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S14 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017638u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S14.
* To use register names with standard convension, please use ERAY1_RDDS_1S14.
*/
#define	ERAY1_RDDS15	(ERAY1_RDDS_1S14)

/** \\brief  63C, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S15 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001763Cu)

/** Alias (User Manual Name) for ERAY1_RDDS_1S15.
* To use register names with standard convension, please use ERAY1_RDDS_1S15.
*/
#define	ERAY1_RDDS16	(ERAY1_RDDS_1S15)

/** \\brief  640, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S16 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017640u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S16.
* To use register names with standard convension, please use ERAY1_RDDS_1S16.
*/
#define	ERAY1_RDDS17	(ERAY1_RDDS_1S16)

/** \\brief  644, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S17 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017644u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S17.
* To use register names with standard convension, please use ERAY1_RDDS_1S17.
*/
#define	ERAY1_RDDS18	(ERAY1_RDDS_1S17)

/** \\brief  648, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S18 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017648u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S18.
* To use register names with standard convension, please use ERAY1_RDDS_1S18.
*/
#define	ERAY1_RDDS19	(ERAY1_RDDS_1S18)

/** \\brief  64C, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S19 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001764Cu)

/** Alias (User Manual Name) for ERAY1_RDDS_1S19.
* To use register names with standard convension, please use ERAY1_RDDS_1S19.
*/
#define	ERAY1_RDDS20	(ERAY1_RDDS_1S19)

/** \\brief  608, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017608u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S2.
* To use register names with standard convension, please use ERAY1_RDDS_1S2.
*/
#define	ERAY1_RDDS03	(ERAY1_RDDS_1S2)

/** \\brief  650, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S20 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017650u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S20.
* To use register names with standard convension, please use ERAY1_RDDS_1S20.
*/
#define	ERAY1_RDDS21	(ERAY1_RDDS_1S20)

/** \\brief  654, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S21 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017654u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S21.
* To use register names with standard convension, please use ERAY1_RDDS_1S21.
*/
#define	ERAY1_RDDS22	(ERAY1_RDDS_1S21)

/** \\brief  658, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S22 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017658u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S22.
* To use register names with standard convension, please use ERAY1_RDDS_1S22.
*/
#define	ERAY1_RDDS23	(ERAY1_RDDS_1S22)

/** \\brief  65C, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S23 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001765Cu)

/** Alias (User Manual Name) for ERAY1_RDDS_1S23.
* To use register names with standard convension, please use ERAY1_RDDS_1S23.
*/
#define	ERAY1_RDDS24	(ERAY1_RDDS_1S23)

/** \\brief  660, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S24 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017660u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S24.
* To use register names with standard convension, please use ERAY1_RDDS_1S24.
*/
#define	ERAY1_RDDS25	(ERAY1_RDDS_1S24)

/** \\brief  664, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S25 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017664u)

