keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEray_reg.h
/** Alias (User Manual Name) for ERAY1_RDDS_1S25.
* To use register names with standard convension, please use ERAY1_RDDS_1S25.
*/
#define	ERAY1_RDDS26	(ERAY1_RDDS_1S25)

/** \\brief  668, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S26 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017668u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S26.
* To use register names with standard convension, please use ERAY1_RDDS_1S26.
*/
#define	ERAY1_RDDS27	(ERAY1_RDDS_1S26)

/** \\brief  66C, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S27 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001766Cu)

/** Alias (User Manual Name) for ERAY1_RDDS_1S27.
* To use register names with standard convension, please use ERAY1_RDDS_1S27.
*/
#define	ERAY1_RDDS28	(ERAY1_RDDS_1S27)

/** \\brief  670, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S28 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017670u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S28.
* To use register names with standard convension, please use ERAY1_RDDS_1S28.
*/
#define	ERAY1_RDDS29	(ERAY1_RDDS_1S28)

/** \\brief  674, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S29 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017674u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S29.
* To use register names with standard convension, please use ERAY1_RDDS_1S29.
*/
#define	ERAY1_RDDS30	(ERAY1_RDDS_1S29)

/** \\brief  60C, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S3 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001760Cu)

/** Alias (User Manual Name) for ERAY1_RDDS_1S3.
* To use register names with standard convension, please use ERAY1_RDDS_1S3.
*/
#define	ERAY1_RDDS04	(ERAY1_RDDS_1S3)

/** \\brief  678, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S30 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017678u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S30.
* To use register names with standard convension, please use ERAY1_RDDS_1S30.
*/
#define	ERAY1_RDDS31	(ERAY1_RDDS_1S30)

/** \\brief  67C, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S31 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001767Cu)

/** Alias (User Manual Name) for ERAY1_RDDS_1S31.
* To use register names with standard convension, please use ERAY1_RDDS_1S31.
*/
#define	ERAY1_RDDS32	(ERAY1_RDDS_1S31)

/** \\brief  680, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S32 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017680u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S32.
* To use register names with standard convension, please use ERAY1_RDDS_1S32.
*/
#define	ERAY1_RDDS33	(ERAY1_RDDS_1S32)

/** \\brief  684, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S33 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017684u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S33.
* To use register names with standard convension, please use ERAY1_RDDS_1S33.
*/
#define	ERAY1_RDDS34	(ERAY1_RDDS_1S33)

/** \\brief  688, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S34 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017688u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S34.
* To use register names with standard convension, please use ERAY1_RDDS_1S34.
*/
#define	ERAY1_RDDS35	(ERAY1_RDDS_1S34)

/** \\brief  68C, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S35 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001768Cu)

/** Alias (User Manual Name) for ERAY1_RDDS_1S35.
* To use register names with standard convension, please use ERAY1_RDDS_1S35.
*/
#define	ERAY1_RDDS36	(ERAY1_RDDS_1S35)

/** \\brief  690, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S36 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017690u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S36.
* To use register names with standard convension, please use ERAY1_RDDS_1S36.
*/
#define	ERAY1_RDDS37	(ERAY1_RDDS_1S36)

/** \\brief  694, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S37 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017694u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S37.
* To use register names with standard convension, please use ERAY1_RDDS_1S37.
*/
#define	ERAY1_RDDS38	(ERAY1_RDDS_1S37)

/** \\brief  698, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S38 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017698u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S38.
* To use register names with standard convension, please use ERAY1_RDDS_1S38.
*/
#define	ERAY1_RDDS39	(ERAY1_RDDS_1S38)

/** \\brief  69C, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S39 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001769Cu)

/** Alias (User Manual Name) for ERAY1_RDDS_1S39.
* To use register names with standard convension, please use ERAY1_RDDS_1S39.
*/
#define	ERAY1_RDDS40	(ERAY1_RDDS_1S39)

/** \\brief  610, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S4 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017610u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S4.
* To use register names with standard convension, please use ERAY1_RDDS_1S4.
*/
#define	ERAY1_RDDS05	(ERAY1_RDDS_1S4)

/** \\brief  6A0, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S40 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF00176A0u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S40.
* To use register names with standard convension, please use ERAY1_RDDS_1S40.
*/
#define	ERAY1_RDDS41	(ERAY1_RDDS_1S40)

/** \\brief  6A4, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S41 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF00176A4u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S41.
* To use register names with standard convension, please use ERAY1_RDDS_1S41.
*/
#define	ERAY1_RDDS42	(ERAY1_RDDS_1S41)

