keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEray_reg.h
/** \\brief  6E4, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S57 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF00176E4u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S57.
* To use register names with standard convension, please use ERAY1_RDDS_1S57.
*/
#define	ERAY1_RDDS58	(ERAY1_RDDS_1S57)

/** \\brief  6E8, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S58 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF00176E8u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S58.
* To use register names with standard convension, please use ERAY1_RDDS_1S58.
*/
#define	ERAY1_RDDS59	(ERAY1_RDDS_1S58)

/** \\brief  6EC, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S59 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF00176ECu)

/** Alias (User Manual Name) for ERAY1_RDDS_1S59.
* To use register names with standard convension, please use ERAY1_RDDS_1S59.
*/
#define	ERAY1_RDDS60	(ERAY1_RDDS_1S59)

/** \\brief  618, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S6 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017618u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S6.
* To use register names with standard convension, please use ERAY1_RDDS_1S6.
*/
#define	ERAY1_RDDS07	(ERAY1_RDDS_1S6)

/** \\brief  6F0, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S60 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF00176F0u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S60.
* To use register names with standard convension, please use ERAY1_RDDS_1S60.
*/
#define	ERAY1_RDDS61	(ERAY1_RDDS_1S60)

/** \\brief  6F4, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S61 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF00176F4u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S61.
* To use register names with standard convension, please use ERAY1_RDDS_1S61.
*/
#define	ERAY1_RDDS62	(ERAY1_RDDS_1S61)

/** \\brief  6F8, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S62 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF00176F8u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S62.
* To use register names with standard convension, please use ERAY1_RDDS_1S62.
*/
#define	ERAY1_RDDS63	(ERAY1_RDDS_1S62)

/** \\brief  6FC, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S63 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF00176FCu)

/** Alias (User Manual Name) for ERAY1_RDDS_1S63.
* To use register names with standard convension, please use ERAY1_RDDS_1S63.
*/
#define	ERAY1_RDDS64	(ERAY1_RDDS_1S63)

/** \\brief  61C, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S7 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001761Cu)

/** Alias (User Manual Name) for ERAY1_RDDS_1S7.
* To use register names with standard convension, please use ERAY1_RDDS_1S7.
*/
#define	ERAY1_RDDS08	(ERAY1_RDDS_1S7)

/** \\brief  620, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S8 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017620u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S8.
* To use register names with standard convension, please use ERAY1_RDDS_1S8.
*/
#define	ERAY1_RDDS09	(ERAY1_RDDS_1S8)

/** \\brief  624, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY1_RDDS_1S9 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017624u)

/** Alias (User Manual Name) for ERAY1_RDDS_1S9.
* To use register names with standard convension, please use ERAY1_RDDS_1S9.
*/
#define	ERAY1_RDDS10	(ERAY1_RDDS_1S9)

/** \\brief  700, Read Header Section 1 */
#define ERAY1_RDHS1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDHS1*)0xF0017700u)

/** \\brief  704, Read Header Section 2 */
#define ERAY1_RDHS2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDHS2*)0xF0017704u)

/** \\brief  708, Read Header Section 3 */
#define ERAY1_RDHS3 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDHS3*)0xF0017708u)

/** \\brief  110, Slot Counter Value */
#define ERAY1_SCV /*lint --e(923)*/ (*(volatile Ifx_ERAY_SCV*)0xF0017110u)

/** \\brief  120, SYNC Frame Status */
#define ERAY1_SFS /*lint --e(923)*/ (*(volatile Ifx_ERAY_SFS*)0xF0017120u)

/** \\brief  3C, Status Service Request Enable Reset */
#define ERAY1_SIER /*lint --e(923)*/ (*(volatile Ifx_ERAY_SIER*)0xF001703Cu)

/** \\brief  38, Status Service Request Enable Set */
#define ERAY1_SIES /*lint --e(923)*/ (*(volatile Ifx_ERAY_SIES*)0xF0017038u)

/** \\brief  2C, Status Service Request Line Select */
#define ERAY1_SILS /*lint --e(923)*/ (*(volatile Ifx_ERAY_SILS*)0xF001702Cu)

/** \\brief  24, Status Service Request Register */
#define ERAY1_SIR /*lint --e(923)*/ (*(volatile Ifx_ERAY_SIR*)0xF0017024u)

/** \\brief  4C, Stop Watch Register 1 */
#define ERAY1_STPW1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_STPW1*)0xF001704Cu)

/** \\brief  50, Stop Watch Register 2 */
#define ERAY1_STPW2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_STPW2*)0xF0017050u)

/** \\brief  80, SUC Configuration Register 1 */
#define ERAY1_SUCC1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_SUCC1*)0xF0017080u)

