keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEray_reg.h
/** \\brief  84, SUC Configuration Register 2 */
#define ERAY1_SUCC2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_SUCC2*)0xF0017084u)

/** \\brief  88, SUC Configuration Register 3 */
#define ERAY1_SUCC3 /*lint --e(923)*/ (*(volatile Ifx_ERAY_SUCC3*)0xF0017088u)

/** \\brief  124, Symbol Window and Network Idle Time Status */
#define ERAY1_SWNIT /*lint --e(923)*/ (*(volatile Ifx_ERAY_SWNIT*)0xF0017124u)

/** \\brief  44, Timer 0 Configuration */
#define ERAY1_T0C /*lint --e(923)*/ (*(volatile Ifx_ERAY_T0C*)0xF0017044u)

/** \\brief  48, Timer 1 Configuration */
#define ERAY1_T1C /*lint --e(923)*/ (*(volatile Ifx_ERAY_T1C*)0xF0017048u)

/** \\brief  10, Test Register 1 */
#define ERAY1_TEST1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_TEST1*)0xF0017010u)

/** \\brief  14, Test Register 2 */
#define ERAY1_TEST2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_TEST2*)0xF0017014u)

/** \\brief  320, Transmission Request Register 1 */
#define ERAY1_TXRQ1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_TXRQ1*)0xF0017320u)

/** \\brief  324, Transmission Request Register 2 */
#define ERAY1_TXRQ2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_TXRQ2*)0xF0017324u)

/** \\brief  328, Transmission Request Register 3 */
#define ERAY1_TXRQ3 /*lint --e(923)*/ (*(volatile Ifx_ERAY_TXRQ3*)0xF0017328u)

/** \\brief  32C, Transmission Request Register 4 */
#define ERAY1_TXRQ4 /*lint --e(923)*/ (*(volatile Ifx_ERAY_TXRQ4*)0xF001732Cu)

/** \\brief  400, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S0 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017400u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S0.
* To use register names with standard convension, please use ERAY1_WRDS_1S0.
*/
#define	ERAY1_WRDS01	(ERAY1_WRDS_1S0)

/** \\brief  404, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017404u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S1.
* To use register names with standard convension, please use ERAY1_WRDS_1S1.
*/
#define	ERAY1_WRDS02	(ERAY1_WRDS_1S1)

/** \\brief  428, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S10 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017428u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S10.
* To use register names with standard convension, please use ERAY1_WRDS_1S10.
*/
#define	ERAY1_WRDS11	(ERAY1_WRDS_1S10)

/** \\brief  42C, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S11 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001742Cu)

/** Alias (User Manual Name) for ERAY1_WRDS_1S11.
* To use register names with standard convension, please use ERAY1_WRDS_1S11.
*/
#define	ERAY1_WRDS12	(ERAY1_WRDS_1S11)

/** \\brief  430, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S12 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017430u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S12.
* To use register names with standard convension, please use ERAY1_WRDS_1S12.
*/
#define	ERAY1_WRDS13	(ERAY1_WRDS_1S12)

/** \\brief  434, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S13 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017434u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S13.
* To use register names with standard convension, please use ERAY1_WRDS_1S13.
*/
#define	ERAY1_WRDS14	(ERAY1_WRDS_1S13)

/** \\brief  438, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S14 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017438u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S14.
* To use register names with standard convension, please use ERAY1_WRDS_1S14.
*/
#define	ERAY1_WRDS15	(ERAY1_WRDS_1S14)

/** \\brief  43C, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S15 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001743Cu)

/** Alias (User Manual Name) for ERAY1_WRDS_1S15.
* To use register names with standard convension, please use ERAY1_WRDS_1S15.
*/
#define	ERAY1_WRDS16	(ERAY1_WRDS_1S15)

/** \\brief  440, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S16 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017440u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S16.
* To use register names with standard convension, please use ERAY1_WRDS_1S16.
*/
#define	ERAY1_WRDS17	(ERAY1_WRDS_1S16)

/** \\brief  444, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S17 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017444u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S17.
* To use register names with standard convension, please use ERAY1_WRDS_1S17.
*/
#define	ERAY1_WRDS18	(ERAY1_WRDS_1S17)

/** \\brief  448, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S18 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017448u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S18.
* To use register names with standard convension, please use ERAY1_WRDS_1S18.
*/
#define	ERAY1_WRDS19	(ERAY1_WRDS_1S18)

/** \\brief  44C, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S19 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001744Cu)

/** Alias (User Manual Name) for ERAY1_WRDS_1S19.
* To use register names with standard convension, please use ERAY1_WRDS_1S19.
*/
#define	ERAY1_WRDS20	(ERAY1_WRDS_1S19)

/** \\brief  408, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017408u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S2.
* To use register names with standard convension, please use ERAY1_WRDS_1S2.
*/
#define	ERAY1_WRDS03	(ERAY1_WRDS_1S2)

