keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEray_reg.h
/** \\brief  450, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S20 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017450u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S20.
* To use register names with standard convension, please use ERAY1_WRDS_1S20.
*/
#define	ERAY1_WRDS21	(ERAY1_WRDS_1S20)

/** \\brief  454, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S21 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017454u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S21.
* To use register names with standard convension, please use ERAY1_WRDS_1S21.
*/
#define	ERAY1_WRDS22	(ERAY1_WRDS_1S21)

/** \\brief  458, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S22 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017458u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S22.
* To use register names with standard convension, please use ERAY1_WRDS_1S22.
*/
#define	ERAY1_WRDS23	(ERAY1_WRDS_1S22)

/** \\brief  45C, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S23 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001745Cu)

/** Alias (User Manual Name) for ERAY1_WRDS_1S23.
* To use register names with standard convension, please use ERAY1_WRDS_1S23.
*/
#define	ERAY1_WRDS24	(ERAY1_WRDS_1S23)

/** \\brief  460, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S24 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017460u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S24.
* To use register names with standard convension, please use ERAY1_WRDS_1S24.
*/
#define	ERAY1_WRDS25	(ERAY1_WRDS_1S24)

/** \\brief  464, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S25 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017464u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S25.
* To use register names with standard convension, please use ERAY1_WRDS_1S25.
*/
#define	ERAY1_WRDS26	(ERAY1_WRDS_1S25)

/** \\brief  468, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S26 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017468u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S26.
* To use register names with standard convension, please use ERAY1_WRDS_1S26.
*/
#define	ERAY1_WRDS27	(ERAY1_WRDS_1S26)

/** \\brief  46C, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S27 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001746Cu)

/** Alias (User Manual Name) for ERAY1_WRDS_1S27.
* To use register names with standard convension, please use ERAY1_WRDS_1S27.
*/
#define	ERAY1_WRDS28	(ERAY1_WRDS_1S27)

/** \\brief  470, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S28 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017470u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S28.
* To use register names with standard convension, please use ERAY1_WRDS_1S28.
*/
#define	ERAY1_WRDS29	(ERAY1_WRDS_1S28)

/** \\brief  474, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S29 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017474u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S29.
* To use register names with standard convension, please use ERAY1_WRDS_1S29.
*/
#define	ERAY1_WRDS30	(ERAY1_WRDS_1S29)

/** \\brief  40C, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S3 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001740Cu)

/** Alias (User Manual Name) for ERAY1_WRDS_1S3.
* To use register names with standard convension, please use ERAY1_WRDS_1S3.
*/
#define	ERAY1_WRDS04	(ERAY1_WRDS_1S3)

/** \\brief  478, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S30 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017478u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S30.
* To use register names with standard convension, please use ERAY1_WRDS_1S30.
*/
#define	ERAY1_WRDS31	(ERAY1_WRDS_1S30)

/** \\brief  47C, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S31 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001747Cu)

/** Alias (User Manual Name) for ERAY1_WRDS_1S31.
* To use register names with standard convension, please use ERAY1_WRDS_1S31.
*/
#define	ERAY1_WRDS32	(ERAY1_WRDS_1S31)

/** \\brief  480, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S32 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017480u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S32.
* To use register names with standard convension, please use ERAY1_WRDS_1S32.
*/
#define	ERAY1_WRDS33	(ERAY1_WRDS_1S32)

/** \\brief  484, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S33 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017484u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S33.
* To use register names with standard convension, please use ERAY1_WRDS_1S33.
*/
#define	ERAY1_WRDS34	(ERAY1_WRDS_1S33)

/** \\brief  488, Write Data Section \note Array index shifted by 1. Example:
 * defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
#define ERAY1_WRDS_1S34 /*lint --e(923)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017488u)

/** Alias (User Manual Name) for ERAY1_WRDS_1S34.
* To use register names with standard convension, please use ERAY1_WRDS_1S34.
*/
#define	ERAY1_WRDS35	(ERAY1_WRDS_1S34)

